In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('Pizza consumption Dataset.xlsx')

In [3]:
df.head()

   pizza  female  income  age    Education
0    109       1   15000   25   Uneducated
1    114       1   30000   45   Uneducated
2    193       1   12000   20   Uneducated
3    108       1   20000   28   Uneducated
4    220       1   15000   25  High School

In [4]:
df.describe()

            pizza     female         income        age
count   40.000000  40.000000      40.000000  40.000000
mean   202.625000   0.525000   42925.000000  33.475000
std    146.715089   0.505736   39358.566982  10.253173
min      9.000000   0.000000    6000.000000  18.000000
25%     92.250000   0.000000   21500.000000  24.750000
50%    144.500000   1.000000   30000.000000  32.000000
75%    305.250000   1.000000   55000.000000  40.000000
max    590.000000   1.000000  222000.000000  55.000000

In [6]:
df.head(2)

   pizza  female  income  age   Education
0    109       1   15000   25  Uneducated
1    114       1   30000   45  Uneducated

In [8]:
df.iloc[1]

pizza               114
female                1
income            30000
age                  45
Education    Uneducated
Name: 1, dtype: object

In [11]:
df.loc[1]

pizza               114
female                1
income            30000
age                  45
Education    Uneducated
Name: 1, dtype: object

In [12]:
df.index

RangeIndex(start=0, stop=40, step=1)

In [13]:
df.index = df['pizza']

In [14]:
df.head()

       pizza  female  income  age    Education
pizza
109      109       1   15000   25   Uneducated
114      114       1   30000   45   Uneducated
193      193       1   12000   20   Uneducated
108      108       1   20000   28   Uneducated
220      220       1   15000   25  High School

In [20]:
df.describe()

            pizza     female         income        age
count   40.000000  40.000000      40.000000  40.000000
mean   202.625000   0.525000   42925.000000  33.475000
std    146.715089   0.505736   39358.566982  10.253173
min      9.000000   0.000000    6000.000000  18.000000
25%     92.250000   0.000000   21500.000000  24.750000
50%    144.500000   1.000000   30000.000000  32.000000
75%    305.250000   1.000000   55000.000000  40.000000
max    590.000000   1.000000  222000.000000  55.000000

In [23]:
df.tail()

       pizza  female  income  age        Education
pizza
400      400       0   80000   36          College
384      384       0   55000   27          College
262      262       0   30000   24          College
336      336       0   27000   21          College
281      281       0   80000   45  Post Graduation

In [22]:
df.iloc[39]

pizza                    281
female                     0
income                 80000
age                       45
Education    Post Graduation
Name: 281, dtype: object

In [24]:
df.loc[281]

pizza                    281
female                     0
income                 80000
age                       45
Education    Post Graduation
Name: 281, dtype: object

In [25]:
df.head(10)

       pizza  female  income  age    Education
pizza
109      109       1   15000   25   Uneducated
114      114       1   30000   45   Uneducated
193      193       1   12000   20   Uneducated
108      108       1   20000   28   Uneducated
220      220       1   15000   25  High School
189      189       1   30000   35  High School
64        64       1   12000   40  High School
262      262       1   12000   22  High School
64        64       1   28000   30  High School
35        35       1   22000   21  High School

In [26]:
df.loc[189]

pizza                189
female                 1
income             30000
age                   35
Education    High School
Name: 189, dtype: object

In [27]:
df.iloc[5]

pizza                189
female                 1
income             30000
age                   35
Education    High School
Name: 189, dtype: object

In [28]:
df.loc[64]

       pizza  female  income  age    Education
pizza
64        64       1   12000   40  High School
64        64       1   28000   30  High School